Revit 2027 API
IFCParameterTemplate.FindPropertyMappingInfo(PropertySetupType, String, ElementId) Method
 Finds the property mapping info in the property set by id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCPropertyMappingInfo FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	ElementId revitPropertyId
)
Public Function FindPropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	revitPropertyId As ElementId
) As IFCPropertyMappingInfo
public:
IFCPropertyMappingInfo^ FindPropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	ElementId^ revitPropertyId
)
member FindPropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        revitPropertyId : ElementId -> IFCPropertyMappingInfo
Parameters
propertySetupType PropertySetupType
 The property setup type.
propertySetName String
 The property set name.
revitPropertyId ElementId
 The Revit property id.
Return Value
IFCPropertyMappingInfo
 The property mapping info or null if not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCParameterTemplate Class
FindPropertyMappingInfo Overload
Autodesk.Revit.DB Namespace